/*******************************************************************************
 ПЭВМ «Микроша»
 ******************************************************************************/

#import "RK86Base.h"
#import "Floppy.h"

@class Microsha;

// -----------------------------------------------------------------------------
// Первый интерфейс 8255, вариант клавиатуры РК86 для Микроши
// -----------------------------------------------------------------------------

@interface MicroshaKeyboard : RKKeyboard

@property (weak) X8253* snd;

@end

// -----------------------------------------------------------------------------
// Второй интерфейс 8255, управление знакогенератором
// -----------------------------------------------------------------------------

@interface MicroshaExt : X8255

@property (weak) X8275 *crt;

@end

// -----------------------------------------------------------------------------
// Вывод байта на магнитофон (Микроша)
// -----------------------------------------------------------------------------

@interface MicroshaF80C : F80C

@end

// -----------------------------------------------------------------------------
// ПЭВМ «Микроша»
// -----------------------------------------------------------------------------

@interface Microsha : RK86Base

@property MicroshaKeyboard *kbd;
@property MicroshaExt *ext;

@property MicroshaF80C *outHook;

@property BOOL isFloppy;

@property Floppy *floppy;
@property ROM *dos29;

@end
