/*******************************************************************************
 ПЭВМ «Микроша»
 ******************************************************************************/

#import "Radio86RK.h"

@class Microsha;

// -----------------------------------------------------------------------------
// Первый интерфейс 8255, вариант клавиатуры РК86 для Микроши
// -----------------------------------------------------------------------------

@interface MicroshaKeyboard : RKKeyboard

@property X8253* snd;

@end

// -----------------------------------------------------------------------------
// Второй интерфейс 8255, управление знакогенератором
// -----------------------------------------------------------------------------

@interface MicroshaExt : X8255

@property X8275 *crt;

@end

// -----------------------------------------------------------------------------
// Модуль дополнительной памяти
// -----------------------------------------------------------------------------

@interface MicroshaExtRAM : NSObject <Adjustment>

- (id) initWithMicrosha:(Microsha *)microsha;

@end

// -----------------------------------------------------------------------------
// FCAB - Вывод байта на магнитофон (Микроша)
// -----------------------------------------------------------------------------

@interface FCAB : F80C

@end

// -----------------------------------------------------------------------------
// ПЭВМ «Микроша»
// -----------------------------------------------------------------------------

@interface Microsha : Radio86RK

@property MicroshaKeyboard *kbd;
@property MicroshaExt *ext;
@property BOOL extRAM;

@end
