#import "Retro80.h"
#import "x8080.h"
#import "x8255.h"

// -----------------------------------------------------------------------------
// Клавиатура РК86 на 8255
// -----------------------------------------------------------------------------

@interface RKKeyboard : X8255 <Keyboard>
{
	// Раскладка клавиатуры (64 кода)

	NSArray* kbdmap;

	// Маски служебных клавиш

	uint8_t RUSLAT;
	uint8_t SHIFT;
	uint8_t CTRL;

	// Маски магнитофона

	uint8_t TAPEI;
	uint8_t TAPEO;
}

// Последняя нажатая кнопка

@property uint8_t key;
- (BOOL) isPaste;

// Для интерфейса магнитофона

@property Sound *snd;

@end

// -----------------------------------------------------------------------------
// F81B - Ввод символа с клавиатуры без ожидания
// -----------------------------------------------------------------------------

@interface F81B : NSObject <Hook, Adjustment>

- (id) initWithRKKeyboard:(RKKeyboard *)kbd;
@property BOOL enabled;

@end

// -----------------------------------------------------------------------------
// F812 - Опрос состояния клавиатуры
// -----------------------------------------------------------------------------

@interface F812 : NSObject <Hook, Adjustment>

- (id) initWithRKKeyboard:(RKKeyboard *)kbd;
@property BOOL enabled;
@property uint8_t key;

@end

// -----------------------------------------------------------------------------
// F803 - Ввод символа с клавиатуры с ожиданием ввода
// -----------------------------------------------------------------------------

@interface F803 : NSObject <Hook>

- (id) initWithF812:(F812 *)F812;

@end
