/*******************************************************************************
 Модификация ПЭВМ «Специалист» с монитором от SP580
 ******************************************************************************/

#import "Specialist.h"

// -----------------------------------------------------------------------------
// Интерфейс клавиатуры ПЭВМ «Специалист» с монитором от SP580
// -----------------------------------------------------------------------------

@interface SpecialistSP580Keyboard : SpecialistKeyboard

@end

// -----------------------------------------------------------------------------
// Интерфейс магнитофона монитора от SP580
// -----------------------------------------------------------------------------

@interface SpecialistSP580_F806 : F806

@end

@interface SpecialistSP580_F80C : F80C

@end


// -----------------------------------------------------------------------------
// ПЭВМ «Специалист» с монитором от SP580
// -----------------------------------------------------------------------------

@interface SpecialistSP580 : Specialist

@property SpecialistSP580Keyboard *kbd;

@property SpecialistSP580_F806 *inpHook;
@property SpecialistSP580_F80C *outHook;

@end
