/*******************************************************************************
 Модификация ПЭВМ «Специалист» с монитором от SP580
 ******************************************************************************/

#import "Specialist.h"

// -----------------------------------------------------------------------------
// Интерфейс клавиатуры ПЭВМ «Специалист» с монитором от SP580
// -----------------------------------------------------------------------------

@interface SpecialistSP580Keyboard : SpecialistKeyboard

@end

// -----------------------------------------------------------------------------
// ПЭВМ «Специалист» с монитором от SP580
// -----------------------------------------------------------------------------

@interface SpecialistSP580 : Specialist

@property SpecialistSP580Keyboard *kbd;

@end
