/*******************************************************************************
 ПЭВМ «Специалист MX»
 ******************************************************************************/

#import "Specialist.h"
#import "vg93.h"

// -----------------------------------------------------------------------------
// Интерфейс клавиатуры ПЭВМ "Специалист MX"
// -----------------------------------------------------------------------------

@interface SpecialistMXKeyboard : SpecialistKeyboard

@end

// -----------------------------------------------------------------------------
// Системные регистры ПЭВМ "Специалист MX"
// -----------------------------------------------------------------------------

@interface SpecialistMXSystem : NSObject <RD, WR, RESET>

@property SpecialistScreen *crt;
@property (weak) X8080 *cpu;
@property VG93 *fdd;

@end

// -----------------------------------------------------------------------------
// ПЭВМ "Специалист MX"
// -----------------------------------------------------------------------------

@interface SpecialistMX : Specialist

@property SpecialistMXKeyboard *kbd;
@property SpecialistMXSystem *sys;
@property VG93 *fdd;

@end
