/*****

 Проект «Ретро КР580» (http://uart.myqnapcloud.com/retro80.html)
 Copyright © 2014-2016 Andrey Chicherov <chicherov@mac.com>

 Модификация ПЭВМ «Специалист» с монитором от SP580

 *****/

#import "Specialist.h"

// -----------------------------------------------------------------------------
// Интерфейс клавиатуры ПЭВМ «Специалист» с монитором от SP580
// -----------------------------------------------------------------------------

@interface SpecialistSP580Keyboard : SpecialistKeyboard

@end

// -----------------------------------------------------------------------------
// ПЭВМ «Специалист» с монитором от SP580
// -----------------------------------------------------------------------------

@interface SpecialistSP580 : Specialist

@property SpecialistSP580Keyboard *kbd;

@end
